app/controllers/armors_controller.rb

  def index
    armors = Armor.all
---
SELECT "armors".* FROM "armors"