app/controllers/horses_controller.rb

SELECT "horses".* FROM "horses"
---
def index
  horses = Horse.all