app/controllers/weapons_controller.rb

  def index
    weapons = Weapon.all
---
SELECT "weapons".* FROM "weapons"